---
type: DefinitionBindingMapIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# DefinitionBindingMapIterator

`Autodesk.Revit.DB.DefinitionBindingMapIterator` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DefinitionBindingMapIterator | — | `public DefinitionBindingMapIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |
| Property | Key | — | `public virtual Definition Key { get ; }` |